Revit 2027 API
Alignment.GetAlignments(Document) Method
 Returns all alignments in the given document.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<Alignment> GetAlignments(
	Document document
)
Public Shared Function GetAlignments (
	document As Document
) As ICollection(Of Alignment)
public:
static ICollection<Alignment^>^ GetAlignments(
	Document^ document
)
static member GetAlignments :
        document : Document -> ICollection<Alignment>
Parameters
document Document
The document for which the alignments are returned.
Return Value
ICollection<Alignment>
See Also
Reference
Alignment Class
GetAlignments Overload
Autodesk.Revit.DB.Infrastructure Namespace